//CTLLOFEC         JOB
/* EXECUTE VSAM DATA LOAD PROGRAM
/*
//CTLLOAD  EXEC PGM=CTLLOFEC
/*
//STEPLIB  DD DSN=KC03FEC.COBOL.LOADLIB,DISP=SHR
//CTLDATA  DD DSN=KC03FEC.A4.CTL.DATA,DISP=SHR
//OUTFILE  DD DSN=KC03FEC.A4.CICS.CTLFEC,DISP=SHR
/*