//INVLOFEC         JOB
/* EXECUTE VSAM DATA LOAD PROGRAM
/*
//INVLOAD  EXEC PGM=INVLOFEC
/*
//STEPLIB  DD DSN=KC03FEC.COBOL.LOADLIB,DISP=SHR
//INVDATA  DD DSN=KC03FEC.A4.INV.DATA,DISP=SHR
//OUTFILE  DD DSN=KC03FEC.A4.CICS.INVFEC,DISP=SHR
/*