//PRDLOFEC         JOB
/* EXECUTE VSAM DATA LOAD PROGRAM
/*
//PRDLOAD  EXEC PGM=PRDLOFEC
/*
//STEPLIB  DD DSN=KC03FEC.COBOL.LOADLIB,DISP=SHR
//PRDDATA  DD DSN=KC03FEC.A4.PRD.DATA,DISP=SHR
//OUTFILE  DD DSN=KC03FEC.A4.CICS.PRDFEC,DISP=SHR
/*