//PRDLCFEC JOB
/* LIST CATALOG INFORMATION FOR VSAM
//LISTCAT  EXEC  PGM=IDCAMS
//SYSPRINT DD    SYSOUT=A
//SYSIN    DD    *
     LISTCAT -
           ENTRIES(KC03FEC.A4.CICS.PRDFEC) -
           CLUSTER -
           ALL
/*