      *
       01 WS-CUSTOMER-MASTER-RECORD.
           05 WS-CM-KEY.
               10 WS-CM-CUSTOMER-NUMBER       PIC X(6).
           05 WS-CM-FIRST-NAME                PIC X(20).
           05 WS-CM-LAST-NAME                 PIC X(30).
           05 WS-CM-ADDRESS                   PIC X(30).
           05 WS-CM-CITY                      PIC X(20).
           05 WS-CM-STATE                     PIC X(2).
           05 WS-CM-ZIP-CODE                  PIC X(10).
      *
