//CMFLOFEC         JOB
/* EXECUTE VSAM DATA LOAD PROGRAM
/*
//CMFLOAD  EXEC PGM=CMFLOFEC
/*
//STEPLIB  DD DSN=KC03FEC.COBOL.LOADLIB,DISP=SHR
//CMDATA   DD DSN=KC03FEC.A1.CUSTMAS.DATA,DISP=SHR
//OUTFILE  DD DSN=KC03FEC.A1.CICS.CMFFEC,DISP=SHR
/*