//CMFIEFEC         JOB
/* EX VSAM INIT
/*
//CMFINIT  EXEC PGM=CMFINFEC
/*
//STEPLIB  DD DSN=KC03FEC.COBOL.LOADLIB,DISP=SHR
//OUTFILE  DD DSN=KC03FEC.A1.CICS.CMFFEC,DISP=SHR